src/cf/Catalogs/CRM_Решения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_Решения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор решения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноДляВнешнегоПользователя</Name>
					<Comment>Доступно для внешнего пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВложений</Name>
					<Comment>Источник вложений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Решения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКатегория</Name>
					<Comment>Основная категория</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КатегорииРешений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект/процесс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРешения</Name>
					<Comment>Статус решения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыРешений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстВопроса</Name>
					<Comment>Текст вопроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстВопросаHTML</Name>
					<Comment>Текст вопроса в формате HTML</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
					<Comment>Категории</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_КатегорииРешений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
					<Comment>Ответы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвторИзменения</Name>
							<Comment>Автор изменения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Comment>Вариант ответа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтветаHTML</Name>
							<Comment>Вариант ответа в формате HTML</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОтвета</Name>
							<Comment>Наименование ответа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусОтвета</Name>
							<Comment>Статус ответа</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_СтатусыРешений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>удалитьCRM_НомерСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_СтатусыРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыРешений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Личное</Name>
					<Comment>Личное</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
					<Comment>На рассмотрении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
					<Comment>Утверждено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устарело</Name>
					<Comment>Устарело</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_Решения/Forms/ФормаВыбора/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Устанавливаем отбор по текущему пользователю и статусам решений.
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "ОтборРешений" Тогда
			Для Каждого ОтборРешения Из ЭлементОтбора.Элементы Цикл
				Если ОтборРешения.Представление = "ОтборПоАвтору" Тогда
					ОтборРешения.ПравоеЗначение = Пользователи.АвторизованныйПользователь();
				ИначеЕсли ОтборРешения.Представление = "ОтборПоСтатусу" Тогда	
					СписокСостояний = Новый СписокЗначений;
					СписокСостояний.Добавить(Перечисления.CRM_СтатусыРешений.Утверждено);
					СписокСостояний.Добавить(Перечисления.CRM_СтатусыРешений.Устарело);
					Если CRM_БазаЗнанийСервер.ЕстьПраваАдминистратора() Тогда
						СписокСостояний.Добавить(Перечисления.CRM_СтатусыРешений.НаРассмотрении);
					КонецЕсли;	
					ОтборРешения.ПравоеЗначение = СписокСостояний;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры // ПриСозданииНаСервере()
